jwvance/Hummingbird/Hummingbird(Continuous Output).cydsn/Generated_Source/PSoC5/TIMER_SAMPLERATE.c
/*******************************************************************************
* Function Name: TIMER_SAMPLERATE_SetCaptureCount
********************************************************************************
*
* Summary:
*  This function sets the capture count
*
* Parameters:
*  captureCount: A value between 2 and 127 inclusive is valid.  A value of 1
*                to 127 will cause the interrupt to delay by the same number of
*                captures.
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_SAMPLERATE_SetCaptureCount(uint8 captureCount) 
{
    TIMER_SAMPLERATE_CAP_COUNT = captureCount;
}


/*******************************************************************************
* Function Name: TIMER_SAMPLERATE_ReadCaptureCount
********************************************************************************
*
* Summary:
*  This function reads the capture count setting
*
* Parameters:
*  void
*
* Return:
*  Returns the Capture Count Setting
*
*******************************************************************************/
uint8 TIMER_SAMPLERATE_ReadCaptureCount(void) 
{
    return ((uint8)TIMER_SAMPLERATE_CAP_COUNT);
}
#endif /* TIMER_SAMPLERATE_UsingHWCaptureCounter */


/*******************************************************************************
* Function Name: TIMER_SAMPLERATE_ClearFIFO
********************************************************************************
*
* Summary:
*  This function clears all capture data from the capture FIFO
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_SAMPLERATE_ClearFIFO(void) 
{
    while(0u != (TIMER_SAMPLERATE_ReadStatusRegister() & TIMER_SAMPLERATE_STATUS_FIFONEMP))
    {
        (void)TIMER_SAMPLERATE_ReadCapture();
    }
}

#endif /* UDB Specific Functions */


/* [] END OF FILE */
